tutorials/crossFlowTurbineAD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0;
        smoother        DICGaussSeidel;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        maxIter         50;
    }

    p
    {
        $pcorr;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|epsilon|nuTilda|R)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon|nuTilda|R)Final"
    {
        $U;
        relTol          0;
    }
}

SIMPLE
{
    correctPhi          no;
    //nOuterCorrectors    1;
    //nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    //turbOnFinalIterOnly true;

    residualControl
    {
        U               1e-5;
        p               1e-5;
        nuTilda         1e-5;
    }
     //   {
            //~ tolerance 1e-6;
            //~ relTol 0;
        //~ }
        //~ p
        //~ {
            //~ tolerance 5e-4;
            //~ relTol 0;
        //~ }
    //~ }
}

relaxationFactors
{
    fields
    {
        p   0.3;
    }
    equations
    {
        "(U|k|epsilon)"      0.7;
        "(U|k|epsilon)Final" 0.7;
    }
}

//cache
//{
//    grad(U);
//}

// ************************************************************************* //
